{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "trainable": true, "batch_input_shape": [null, 64, 64, 1], "name": "Normalize", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa/D:\\WorkspacePython\\CarND-Capstone\\python\\net.py\u00da\b<lambda>>\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "dtype": "float32", "arguments": {}, "output_shape_type": "raw"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 20, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "name": "conv1", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max1"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "drop1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 32, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "name": "conv2", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max2"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "drop2"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 32, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "name": "conv3", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 620, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "name": "fc1", "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "drop3"}}, {"class_name": "Dense", "config": {"units": 256, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "name": "fc2", "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "name": "fc3", "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dense", "config": {"units": 9, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "name": "fcout", "use_bias": true, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}], "backend": "tensorflow", "keras_version": "2.0.8"}