{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "Normalize", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa/D:\\WorkspacePython\\CarND-Capstone\\python\\net.py\u00da\b<lambda>>\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "batch_input_shape": [null, 64, 64, 1], "trainable": true, "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 20, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "name": "conv1", "data_format": "channels_last", "use_bias": true, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5]}}, {"class_name": "MaxPooling2D", "config": {"name": "max1", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch1", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "drop1", "trainable": true, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "name": "conv2", "data_format": "channels_last", "use_bias": true, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5]}}, {"class_name": "MaxPooling2D", "config": {"name": "max2", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch2", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "drop2", "trainable": true, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "name": "conv3", "data_format": "channels_last", "use_bias": true, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "fc1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "trainable": true, "kernel_regularizer": null, "units": 620, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "drop3", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "fc2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "trainable": true, "kernel_regularizer": null, "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "fc3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "trainable": true, "kernel_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "fcout", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "units": 9, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}], "keras_version": "2.0.8"}