{"backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Lambda", "config": {"trainable": true, "batch_input_shape": [null, 64, 64, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa/D:\\WorkspacePython\\CarND-Capstone\\python\\net.py\u00da\b<lambda>>\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "dtype": "float32", "name": "Normalize", "output_shape_type": "raw", "arguments": {}, "output_shape": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "filters": 20, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "conv1", "activation": "relu", "kernel_size": [5, 5], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max1", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch1", "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "drop1", "rate": 0.5}}, {"class_name": "Conv2D", "config": {"trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "filters": 40, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "conv2", "activation": "relu", "kernel_size": [5, 5], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max2", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch2", "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "drop2", "rate": 0.5}}, {"class_name": "Conv2D", "config": {"trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "conv3", "activation": "relu", "kernel_size": [5, 5], "kernel_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "units": 620, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "fc1", "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "drop3", "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "fc2", "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "fc3", "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 9, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "fcout", "activation": "softmax", "kernel_regularizer": null}}], "class_name": "Sequential"}